{"pageProps":{"headerData":{"id":3,"type":"Career","bgRq":false,"bgClr":"orange-bg","imgAlt":"career planning and development","mainTitle1":"Careers.","mainTitle2":"","subtitle":"Find opportunities to work with us","hideDemoBtn":true,"subTitleHeader":null,"published_at":"2021-07-13T05:09:37.907Z","created_at":"2021-07-13T05:09:14.780Z","updated_at":"2021-07-13T05:15:21.967Z","bgImg":{"id":548,"name":"careers.svg","alternativeText":"","caption":"","width":582,"height":462,"formats":null,"hash":"careers_0f7fed9b85","ext":".svg","mime":"image/svg+xml","size":12.15,"url":"/uploads/careers_0f7fed9b85.svg","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-07-13T03:45:22.724Z","updated_at":"2021-07-13T03:45:22.741Z"},"bgCover":null,"titleImg":null,"sub_headers":[]},"openings":[{"id":5,"title":"Architect – Machine Learning","career_detail":{"id":1,"experience":"5+ Years","education":"Degree in Computer Science or Related discipline","role":"Architect","functionalArea":"Data Science","location":"Bangalore","compensation":"Best in the Industry","career":5,"published_at":"2021-07-29T04:56:40.412Z","created_at":"2021-07-29T04:56:38.303Z","updated_at":"2021-07-29T04:56:40.444Z"},"published_at":"2021-07-28T04:58:22.430Z","created_at":"2021-07-28T04:58:20.439Z","updated_at":"2021-07-29T04:56:38.335Z","career_openings":[{"id":39,"responsibilities":"<ul>\n\t<li>Lead complex technical designs, prototypes/proof of concepts, help platform development.</li>\n\t<li>Design and Build the best of class resilient applications using universally accepted architecture practices and design patterns.</li>\n\t<li>Drive efficiency and reliability improvements through design and automation: performance, scaling, observability, and monitoring.</li>\n\t<li>Create architecture and processes for machine learning related capabilities.</li>\n\t<li>Develop data pipelines that unify various data sources into one cohesive platform for data access.</li>\n\t<li>Design and implement efficient, fault-tolerant Machine Learning workflows for processing high-velocity, heterogeneous data in a production environment, including optimization of ML workflows for CPU & GPU processing.</li>\n\t<li>Manage Machine Learning microservices including containerization, unit testing, performance optimization, and deployment</li>\n\t<li>Work with multiple partner teams within of EdGE and build cross-functional solutions in a collaborative work environment.</li>\n\t<li>Individually contribute by writing code and designing systems.</li>\n\t<li>Mentor and support your fellow teammates, review the team's technical design, code, and documentation.</li>\n</ul>","requirements":"<ul>\n\t<li>Experience leading technical direction, architecting and developing AI/ML Platform or Products, distributed systems and tuning application performance.</li>\n\t<li>Experience in Architecting Machine Learning Related Platform/Product like Search, Conversational Systems, Market Places etc.</li>\n\t<li>Experience in Python, C++, Web services and REST.</li>\n\t<li>Experience in Modern Search technologies (including Solr, Elasticsearch, Lucene, etc.)</li>\n\t<li>Working Knowledge of deep learning frameworks like Tensorflow, Pytorch etc.</li>\n\t<li>Familiar with Machine Learning and Deep learning algorithms.</li>\n\t<li>Strong understanding of metadata, schemas, lineage, data quality.</li>\n\t<li>Experienced with some amount of 'Big Data' technologies such as Kafka, Spark, Hive Graph Datastores.</li>\n\t<li>Strong background in architecting cloud native solutions.</li>\n\t<li>Familiar in MLops, Feature Stores etc.</li>\n\t<li>Familiar with Kubernetes.</li>\n\t<li>Familiar with Compliance Standards – GDPR, ISO etc.</li>\n\t<li>Strong quantitative, analytical and problem-solving skills, combined with a high level of initiative and ability to thrive in a multi-tasking, fast-paced environment .</li>\n</ul>","skills":null,"qualifications":null,"interviewProcess":null,"joinus":null,"career":5,"published_at":"2021-08-20T10:39:35.480Z","created_at":"2021-08-20T10:18:56.594Z","updated_at":"2021-08-20T10:39:35.541Z"}]},{"id":6,"title":"Data Scientist -II","career_detail":{"id":2,"experience":"3+ Years","education":"Degree in Computer Science or Related discipline","role":"Data Scientist","functionalArea":"Data Science","location":"Bangalore","compensation":"Best in the Industry","career":6,"published_at":"2021-07-29T04:57:27.131Z","created_at":"2021-07-29T04:57:23.136Z","updated_at":"2021-07-29T04:57:27.155Z"},"published_at":"2021-07-28T05:14:51.360Z","created_at":"2021-07-28T05:14:48.467Z","updated_at":"2021-07-29T04:57:23.157Z","career_openings":[{"id":40,"responsibilities":"<ul>\n\t<li>Design, Implement and Evaluate models.</li>\n\t<li>You should be passionate about working with huge data sets and be someone who loves to bring datasets together to answer business questions. You should have deep expertise in creation and management of datasets</li>\n\t<li>Rapidly prototype integration of latest research in the field into the product</li>\n\t<li>Collaborate with platform, product, engineering to define specs and deliver iteratively</li>\n\t<li>Build or improve features that impact our users and make them better utilizing ML</li>\n</ul>","requirements":"<ul>\n\t<li>3-5 years of hands-on experience in building machine learning systems for large datasets</li>\n\t<li>Ability to break down and frame business problems into data science solutions and hands-on capability to create MVP out of it and run a DS project end to end independently</li>\n\t<li>Experience in NLP (Sequence segmentation, Labeling and parsing, Knowledge extraction, Question answering, Multi text learning, ontology, taxonomy building), Machine Learning</li>\n\t<li>Experience in Entity Extraction, Entity Linking, Clustering algorithms</li>\n\t<li>Proficient in Deep Learning (VAE, RNN, LSTM, CNN, attention models, etc.), machine learning(svm, random forest), Clustering, topic modeling(LDA, LSA) and graph models</li>\n\t<li>Experience in Python, Scikit-learn, Pytorch, Keras, Tensorflow</li>\n\t<li>Experience of implementing Deep Learning models into production</li>\n\t<li>Familiarity with distributed computing</li>\n</ul>","skills":null,"qualifications":null,"interviewProcess":null,"joinus":null,"career":6,"published_at":"2021-08-20T10:40:22.216Z","created_at":"2021-08-20T10:22:17.205Z","updated_at":"2021-08-20T11:02:36.451Z"}]},{"id":7,"title":"Software Development Engineer – Machine Learning","career_detail":{"id":3,"experience":"5+ Years","education":"Degree in Computer Science or Related discipline","role":"Software Development Engineer- Machine learning","functionalArea":"Data Science","location":"Bangalore ( Can work remotely)","compensation":"Best in the Industry","career":7,"published_at":"2021-07-29T04:59:41.583Z","created_at":"2021-07-29T04:58:18.903Z","updated_at":"2021-07-29T04:59:41.624Z"},"published_at":"2021-07-28T05:21:41.597Z","created_at":"2021-07-28T05:21:39.637Z","updated_at":"2021-07-29T04:58:18.938Z","career_openings":[{"id":41,"responsibilities":"<ul>\n\t<li>Design and develop highly scalable, reliable, and fault-tolerant systems serving machine learning features at scale.</li>\n\t<li>Work with multiple teams within of EdGE and build cross-functional solutions in a collaborative work environment.</li>\n</ul>","requirements":"<ul>\n\t<li>5+ year of hands on experience implementing production systems at scale in Python. Ability to design and implement low latency RESTful services.</li>\n\t<li>Have a deep understanding of system design, data structure and algorithms.</li>\n\t<li>Know how to write distributed, high volume services in Python.</li>\n\t<li>You might have worked with Docker as well as Kafka, Spark, Hive, Airflow Graph Datastores. Expertise with databases (Postgres, Mongo).</li>\n\t<li>You have experienced with deploying and operating services on Linux.</li>\n\t<li>You care about software processes, data-driven development, high quality code.</li>\n\t<li>Familiar with Kubernetes, C++, Tensorflow, Pytorch is a plus.</li>\n\t<li>Strong problem-solving skills, combined with a high level of initiative and ability to thrive in a multi-tasking, fast-paced environment. Influencer with great communication skills, you love sharing your knowledge with others and helping them grow.</li>\n</ul>","skills":null,"qualifications":null,"interviewProcess":null,"joinus":null,"career":7,"published_at":"2021-08-20T11:02:46.407Z","created_at":"2021-08-20T10:25:54.579Z","updated_at":"2021-08-20T11:02:46.478Z"}]},{"id":8,"title":"Data Scientist-II","career_detail":{"id":4,"experience":"3-5 Years","education":"B.S./B.S.E./MS degree in Applied Math, Data Science, Computer Science, Physics, or Similar Technical Field","role":"Data Scientist -II","functionalArea":"Data Science","location":"Bangalore preferred","compensation":"Best in the Industry","career":null,"published_at":"2021-07-29T04:59:08.184Z","created_at":"2021-07-29T04:59:05.102Z","updated_at":"2021-07-29T04:59:08.300Z"},"published_at":"2021-07-28T05:26:38.468Z","created_at":"2021-07-28T05:26:36.480Z","updated_at":"2021-07-28T05:27:21.330Z","career_openings":[{"id":42,"responsibilities":"<ul>\n\t<li>Design, Implement and Evaluate models and Design machine learning systems(NLP, text analytics, information retrieval, search, and recommendation systems, Knowledge graph, conversational system, Time-series based modelling, forecasting).</li>\n\t<li>Design, development, evaluate and deploy innovative and highly scalable ML to improve the quality of products.</li>\n\t<li>You should be passionate about working with data sets and be someone who loves to bring datasets together and use machine learning and analytical techniques to answer business questions and deliver actionable user-insights to build the best products and models.</li>\n\t<li>Rapidly prototype integration of latest research in the field of ML/DL into the product.</li>\n\t<li>Work closely with team of high performing data scientist and single ownership to identify opportunities, design, and assess improvements to ML Engine & Products.</li>\n</ul>","requirements":"<ul>\n\t<li><b>A team player</b>- I know we only win if we all win. I recognise and value the different perspectives and skills my squad mates bring. It is not about being a hero but jumping in and contributing to the successful delivery of our mission.</li>\n\t<li><b>An excellent communicator</b>– I know and understand the importance of clear, on-time communication. My spoken and written communication skills stand out for clarity and conciseness</li>\n\t<li><b>A collaboration champion</b>– I work closely with my colleagues to ensure alignment and champion the sharing of learning across teams.</li>\n\t<li><b>Comfortable being uncomfortable</b>– II am comfortable with uncertainty. I have the ability to effectively manage myself through ambiguity by making meaning, building relationships and creating clarity with my peers.</li>\n\t<li><b>Continuous improvement junkie</b>– I constructively challenge the status quo, I look for better ways of doing things and passionately advocate continuous improvement.</li>\n\t<li><b>Committed to my own and others’ growth</b>– I strive to stretch and grow myself and others by identifying my own development areas, seeking feedback, and providing feedback to others to help them learn and grow every day.</li>\n\t<li><b>A problem solver</b>– I am energised by tackling complex problems. I use my critical thinking, network, skills, knowledge, and available data to drive better outcomes for our customers and the product.</li>\n\t<li><b>Business & Tech curious</b>– I have a wide-angle lens. I am curious about what is happening in the external market and in emerging trends and innovations (technological and otherwise) and how we use this information to better inform our decisions and actions.</li>\n\t<li><b>Risk savvy</b>– I build sustainable solutions that protect stakeholders and customers and proactively address risks by role-modelling improvements in the product’s overall risk and control environment.</li>\n</ul>","skills":"<ul>\n\t<li>3-5 years of hands-on experience in building machine learning systems for large datasets.</li>\n\t<li>Ability to break down and frame business problems into data science solutions and hands-on capability to create MVP out of it and run a DS project end to end independently.</li>\n\t<li>In-depth knowledge on supervised and unsupervised machine learning algorithms including classification, clustering, and regression.</li>\n\t<li>Experience in NLP (Sequence segmentation, Labeling and parsing, Knowledge extraction, Question answering, Multi text learning, ontology, taxonomy building), Machine Learning.</li>\n\t<li>Experience in Entity Extraction, Entity Linking, Clustering algorithms.</li>\n\t<li>Proficient in Math & Deep Learning (VAE, RNN, LSTM, CNN, attention models, Transfomer etc.), machine learning(svm, random forest), Clustering, topic modeling(LDA, LSA) and graph models.</li>\n\t<li>Experience in Python, Scikit-learn, Pytorch, Keras, Tensorflow.</li>\n\t<li>Experience of implementing Deep Learning models into production.</li>\n\t<li>Familiarity with distributed computing</li>\n</ul>","qualifications":"<ul>\n\t<li>Passion to dive deep to resolve problems at their root.</li>\n\t<li>Experience in Data Governance, Data quality, Model Governance & MLops is a huge plus. Functional knowledge of platforms such as MLFLOW, Hopsworks/Sagemaker feature store/feast/Tecton, Seldon, DVC.</li>\n\t<li>Experience on building fair & explainable ML based product.</li>\n\t<li>Experience on federated learning, differential privacy, reinforcement learning.</li>\n\t<li>Experience on A/B testing, federated learning, differential privacy.</li>\n\t<li>Experience of git, flask, restful APIs.</li>\n\t<li>Experience working in a fast-paced, high tech environment</li>\n</ul>","interviewProcess":"<ul>\n\t<li>Round 1: Technical Interview</li>\n\t<li>Round 2: Assignment</li>\n\t<li>Round 3: Detailed discussion on assignment & deeper technical evaluation</li>\n\t<li>Round 4: HR & Culture fit</li>\n</ul>","joinus":"<ul>\n\t<li>We are concerned not only with the growth of the company, but each other’s personal and professional growth,too. We are transparent, open and have a collaborative work environment. And above all, you need to bring your best. The rest does not really matter. With WFH becoming more normalized, you best believe we have been sharing our favorite ways to prioritize a healthy work-life balance at home (Netflix, anyone?).</li>\n</ul>","career":8,"published_at":"2021-08-20T11:02:57.767Z","created_at":"2021-08-20T10:30:16.586Z","updated_at":"2021-08-20T11:02:57.794Z"}]}],"title":{"id":16,"title":"About EDGE","description":" <b>EDGE</b> is a leading skill development and technology solutions provider based in Bangalore, India. Passionate about improving the quality, value and nature of skill development system and making it easily accessible across India, our trump card lies in our ability to use technology and services to identify gaps, and fill those with skills that empower the youth. We excel in Analysis of Big Data, Artificial Intelligence, and Predictive Analysis. Our intelligent apps, tools, services and solutions are designed to accelerate, enhance, improve, and influence growth, trends and efficiency of businesses and create an eco-system based on skills. We build solutions for today and tomorrow’s challenges. The machines of tomorrow will have a revolutionary impact on business and it will have its impact on services ranging from airlines to hospitals, energy to disaster management.","type":"career","published_at":"2021-07-27T11:59:06.918Z","created_at":"2021-07-27T11:59:04.651Z","updated_at":"2021-08-18T08:24:35.416Z"},"emailData":{"id":20,"title":"Interested? Send your details with updated CV to ","description":"careers@getedge.ai","type":"email","published_at":"2021-07-29T08:47:35.221Z","created_at":"2021-07-29T08:47:31.710Z","updated_at":"2021-11-15T08:40:13.506Z"}},"__N_SSG":true}