{"pageProps":{"blogPost":{"id":542,"title":"What's Next With The Future Of Work?","content":"<p>Hi, we are in conversation with Rahul Kulhari, our Head of Data Science at EDGE. I'm Anannya Debnath, and I lead content at EDGE.&nbsp;</p><p>&nbsp;Today, we will discuss the various challenges organizations and employees face in building up their capabilities for the next generation of work. It could be their reactions to the pandemic, their efforts, or problems organizations face in engaging their employees effectively. We'll also talk about changing workplaces and the changing workforce. And then we'll talk about future transformation, what's in store for organizations, for candidates, their skill sets, etc. So, welcome, Rahul. Thank you for being with us today.</p><p>&nbsp;</p><p><strong>Rahul:</strong>&nbsp;Thanks for having me.&nbsp;</p><p>&nbsp;</p><p><strong>Anannya:</strong>&nbsp;So, we spoke about these four things that organizations are facing in India and globally. However, what are the main things that need to be looked into in those specific sectors? Is it skill sets? Is it employee engagement? Then again, employee engagement has different facets like learning and development, mental and physical health. Reports say that the priority for organizations today, and those organizations who are people-centric, is their employees' mental and physical health and well-being in this pandemic. However, they also need to look at the other factors that hamper an employee's growth, apart from their well-being, which is more professional and helps get a perfect career path. So, if you could tell us more on those lines also.</p><p>&nbsp;</p><p><strong>Rahul:</strong>&nbsp;Yeah, so, I think the industry has discovered these problems, and every company, in a way, in every industry, is trying to mitigate these problems and searching for solutions for them. And one of the most significant problem statements starts from the HR tools — HR systems used by the companies, like the ERP's and the CRM systems and how they have been utilized in the past. These HR systems have been static records, ideally developed internally or externally by ERP tools by keeping certain things in mind. They weren't designed by keeping in mind that they will be providing insights or solve the challenges which industry has faced today. This leads to multiple other issues, and employee engagement has come into the picture. But one of the things companies have to focus on today is how they can better enable these tools better? How can they put better HR systems into the picture, or how can they utilize the HR systems. For example, I'm just going to talk about one other thing quickly. Every company allows its services based companies, which we have seen is focused on two specific kinds of things, and where they spend a reasonable&nbsp;amount of time and money on that piece. And then the effort. Basically,&nbsp;the query architectures and the competency normalization and the competency structures we stay to have, right, because it becomes the source of information for the company to map their jobs and company to map their employees to those skills, competencies and the roles actually, right. And by the time they are done with like, like, obviously, the companies does have the internal experts, but they mainly work with third-party experts. And because of the static behaviour, what happens when experts are done with the changes? That environment has changed. So it becomes irrelevant when it goes to the real users and goes to the natural environment. It becomes no use for the organization, behaviour, culture and the people's business or employees visibility and becomes a challenge. I think that's where they need to start utilizing the tools and the products.</p><p>&nbsp;And they have been utilized technology basically to provide the dynamic environment and the behaviour, which can solve the need of the time. And also look at the long term and the small-term and medium-term goals and the companies to enhance them keyaki they're ready for the future as well. And they're prepared for the current environment as well. And it is prepared to sell to the people in the according to their need. Right. And so that's where companies have to focus on these kinds of products and tools are the technologies. Now, once this problem is solved, I think what does it look like to the second one of the most significant problem statements, which happens in the\\industry, is the internal job boards actually, right? Because in the end, before attrition occurs, people must lookout for better jobs inside the company because that's easier than anything. Some companies don't have internal job boards, which&nbsp;doesn't provide that visibility and transparency, that can enable that growth, give some objective for people to look at the development inside the company. This is where today's internal job boards can't compete with the technology available outside because they don't have an excellent user experience. They don't personalize job recommendations based on people's skills or aspirations, which they have. And then that's where which leads to the there are specific behaviour and the policies the way they have designed, which will lead to the environment ofbeing not having the right kind of visibility's actually like like employees&nbsp;doesn't have the visibility on the jobs based on the companies' policies because of certain circumstances. And it's, so these create an unpleasant experience for the employees. And they don't see any futuristic growth, which leads to finding alignment in other companies or other environments and the culture. So I think companies have to focus on internal job boards, or some tools and the technology which can provide a great user experience, personalized jobs, and transparency about the policies and what are how does the company look at them from the jobs perspective and how they can we target to the next call, as part of the carrier growth. What&nbsp;are the possibilities inside the company that's where the technology can&nbsp;help them. Most organizations today are outsourcing these capabilities. They have started exploring different tools with smart intelligence. Here, AI-based personalized job recommendations have gained critical momentum for people to keep engaged inside the company. With that, HR and company leaders are coming to understand the power of AI and enable better engagement by putting the right technology product and the platform inside the company that can provide this kind of great experience.&nbsp;</p><p>&nbsp;</p><p><strong>Anannya:</strong>&nbsp;So, Rahul, if I could ask you at what stage is this in organizations today? Is it relatively nascent? As you said, it is also a significant source of attrition that people don't have that kind of visibility. So, how major is this issue today? How are our organizations even realizing this?</p><p>&nbsp;</p><p><strong>Rahul:&nbsp;</strong>So, I think many of you thought of it. They may have realized that they need to do something to stop attrition, but do they realize that there is a need for an effective mechanism to increase internal hiring's, visibility, speed of hiring but at the same time reduce costs. With such a mechanism, all these factors ought to be met. Some companies have job boards, which is very tightly connected with the HR based ERP systems or some different kinds of systems.&nbsp;</p><p>Now, what happens is that companies are unable to hire people internally, and employees are not able to align to their jobs or are not applying to the internally available jobs because obviously, the transparency is not available, visibility is not there. So, these need to be worked on. Organizations have to change their orientation of 'employ first and search later'. Internal employees, referrals can close positions faster internally, but I think that happens rarely. And that happens with a specific set of people. Now, that's where HR systems like EDGE Pathfinder come into play. If you look at today's data, more than 30 to 50% of people don't put their information on HR systems.. their skill sets are known to a few, maybe their manager or colleagues. There are mental records but no physical records. That's not a scalable approach; it will not help companies come out of these kinds of crises. As I said, organizations need to change their approach.</p><p>They need to move to 'employee first from business first' because it is&nbsp;their employees who make and break them. Thus, it is essential to match their aspirations to those people and support their next career move. With the right kind of mechanisms and tools, people will stop relying on mental abilities and put stress on capturing the information in the right way. Gradually it'll build up the confidence of the employee, and they will start trusting these tools. That's the right way to scalably solve these problems and answer the organization's medium-term and long-term goals. It'll make them future-ready.</p><p>&nbsp;</p><p><strong>Anannya:</strong>&nbsp;So, this is more from an organizational perspective. How aware are employees of this one? Second, there are multiple reports published now and then that speak about cloud computing, SAAS, etc., as the skill sets trending today. How does it help me as an employee? Am I skilled enough to do that? Or what is the skill set that I need to grow to be relevant in the next two to three years? How is that working out from an employee perspective? What is the challenge on that front?</p><p>&nbsp;</p><p><strong>Rahul:&nbsp;</strong>Sure. So I think the topics in the previous point, like the HR systems, internal job boards, or others, are disconnected systems. The need is for one centralized platform, which obviously will answer your question as well. It will align organizational goals to employee goals, see employee aspirations and suggest skill sets relevant to grow. So, in a way, personalized job recommendations will help them move towards their aspiration, like the training skills they're targeting. But certain rescaling, upscaling can happen immediately; certain paths can be taken immediately.</p><p>I think there must be a proper strategy and plan for the reskilling by the organization based on the employees need as well. First, let me speak about what organizations think about it because it's a critical need for the organization as well. And that need has come into the picture because they are not able to reduce the workforce, or they're not able to relocate the resources to the right project or attritions, and the alignment and the automation. Because of that, it has forced companies to become employees first, which leads to focusing on rescaling and upskilling as an opportunity.&nbsp;</p><p>&nbsp;According to a McKinsey survey, 43% of organization's say they have a skill gap today. This means they don't have people with the relevant skill sets to take them to their next growth step. In the next two years, 22% said they would have the skill gap in the next two years. And the remaining 22% say they will have in the next two, three to five years. And some other percentages of people say they do have in more than six to 10 years. Now, this is a large percentage.&nbsp;&nbsp;</p><p>&nbsp;Companies have to focus on the new skill sets, mitigate the need for reskilling and rescaling, and focus on providing the right skill set for people to learn. Now, again, it has to be done by two ways because if you look at companies, they used to have the internal L&amp;D teams or competencies team which were helping people to align what kind of skill the path they need to take. That's where one problem existed because every organization has a limited set of the catalogue for people to reskill/upskill their careers based on their aspirations. And organizations were not giving preference to it. And due to the lack of information, like obviously, people also need to have the right kind of environment and knowledge about the competencies for rescaling who should be skilled, because it was becoming difficult for companies to design personalized reskilling path. Skills are becoming obsolete, the obsolete that companies face today; it has because of automation, which means many organizations don't have any choice to remain existing in the current environment or become better than their competition. So, they have to focus on the skill game.</p><p>If you think from the employee perspective, they know skill is coming to the market but do not know if they are capable of adapting to it or need the skill-set, but these are becoming their aspiration. Now, how can they target that aspiration? And how can they focus on that aspiration? That's where the ideal fulfilment has to happen through some platform. And, that platform has to be highly engaged with every tool with the organization, specially LXP's, because previously, the approach was taken top-to-bottom. Now the approach will also be bottom-to-top in the dynamic environment where employees have the freedom to choose what kind of skill-set they desire to have or learn.</p><p>The other issue for you to look at as part of reskilling is that earlier, and every organization had specialized people. There are four kinds of competencies or models that exist.&nbsp; <strong>I</strong>, which means people are competent or have the competency in one kind of area;&nbsp;<strong>T</strong>&nbsp;where people are competent in one kind of area, but they do have the breadth across multiple competencies. The third model is&nbsp;<strong>Pi</strong>&nbsp;which means people have depth across two competencies, but they do have the breadth also, and&nbsp;<strong>Cos</strong>&nbsp;where people have the competency across multiple other things and the breadth across multiple skill sets. Now, people have realized because of the dynamic behaviour of automation, companies and employees want to move from AI to t, or I to pi, or T to pi or T to Cos. If you look at companies that are leading the world in the innovations, their people belong to the Cos kind of competencies. Those who lead to the kind of growth they're creating, the innovation they're making for companies to sustain in the future and lead countries and the world in a new way defining the new dimensions. Now, every employee wants to move from one level to another, and that costs, right? And that's where companies are trying to define that. They want to provide transparency; they want to give visibility and work on something new to sustain in the new environment. So if this kind of crisis happens, employees are ready to take the lead. And this rescaling will enable the new leaders; it will help them in the succession planning, it will help them in the reduction of the cost as well. Now think about it. I'm just going to give an example. Today, the specific specialized people you hired to work on high-value projects need multiple specializations. Then again, you need more with another specialization. To hire specialists, the organization has to make that extra spend, the extra investment. Now, what if the same two people can be upskilled as a part of their aspirational plan? It's a win-win for both. The organization saves costs, and the employee moves to the next level. This is precisely what the platform should allow you to do. This is exactly what EDGE Pathfinder will enable you to achieve. It understands what is happening in the market, can decipher the current or future needs of the organization, details the needs and aspirations of the employees and links them in unison. But this experience will not be enough without having the right kind of LXP because you can create the right kind of recommendation for the skills. You can learn. You can tell people okay, learn artificial intelligence, machine learning, analytics, blockchain, augmented reality or virtual reality, but what if they are not suitable methods to focus on or the company doesn't have the appropriate learning materials in place? In that case, they're still not getting what they need, and the employee may quit for better pastures.&nbsp;</p><p>However, if you have the right kind of LXP plus this kind of platform, then what happens? It leads to your employee satisfaction, and it leads to most of the positions are getting fulfilled internally. This will help companies to achieve the two things as well. And that's where an employer will become the enabler. And the from past, which was a business was the enabler. I think the employee will be the enabler; they will start taking control, acquire revenue through new channels, and be poised to be ahead of the competition by utilizing futuristic technology. People will automatically start thinking about taking more control and act very quickly in dynamic environments to increase the growth and benefit the environment. At this juncture, we can safely say that the two create more value for each other.&nbsp;</p><p>&nbsp;</p><p><strong>Anannya:</strong>&nbsp;So if I could say this in a brief, today, the skill gap is quite blurring. Organizations don't know which skills will be helpful to mark a change, achieve targets, and make profits. And they will also be able to guide their employees in that space. But as of now, it's pretty nascent. Both are still learning.</p><p>&nbsp;</p><p><strong>Rahul:</strong>&nbsp;Yes, I'd like to add on top what you said. See, it's happening because if you're taking the people-driven process, it's not easy to build a contextualized learning for each employee. Think about the organization size of more than 100,000, 50,000, becomes very difficult if you take a people-oriented approach. And that's where the platform has to come into the picture, which can solve this problem at the scale because the platform will have the AI and AI will have the information or should have the information, intelligence from the market which leads to the future. And look at the ambition which people do have and consider all the factors. Today, people are thinking from the organizational perspective, some companies are thinking from the employees perspective, some companies are thinking from the board, organization and employees perspective, but I believe this environment will help each company because of their limitations, which will help them to get all these at the larger scales, very contextualized learning who can raise to what kind of skill set who can focus on what type of skill sets.</p><p>If you put two kinds of people on the same skill set, they coming out from different backgrounds the learning will be difficult, very different actually. You can't also put a timeline to how much time they'll take to get upskilled or re-skilled. Both are very different personalities with different capabilities. So, it's essential that organizations take a leap. And think of not what is going to happen in five years, down the line. But basically, think of short term goals. How can I bridge the gap and reach achieve my yearly growth? Because it's so unprecedented that we never know where the industry will take us in the next few months, where the situation will be. Yeah, and what kind of technology will be introduced? So it helps companies to be ready for in the short term, medium-term and the long term and futuristic as well? We are hearing the news of companies becoming digital-ready because certain companies act because of their people. Why were they able to do that? Because people were upskilled, re-skilled, and the company utilized the technology to enable people to be ready in that concern, that kind of environment. And people creating more value through high value created projects. So, we addressed all four issues one by one.</p><p>&nbsp;</p><p><strong>Anannya:</strong>&nbsp;Now, if I could ask you what is your take on the future workforce? Workplaces, we know, are changing. And that is the reason organizations are getting employees ready, digital-ready, things like that. But what about the workforce? So basically, yes, the workforce is not yet prepared; they are not. Still there, they are aiming to be there. But with the changing workforce, the current workforce is dominated by seniors and millennials. And the next workforce is Gen Z, which is similar to the millennial but very different. And reports say that by 2025 1/3 of the working force will be Gen Z, and we're pretty advanced in these aspects.</p><p>So, what are your thoughts on the challenges for organizations to deal with that kind of workforce? They are getting prepared for the challenge today to<strong>&nbsp;</strong>hit the pandemic; you're on its and move forward,<strong>&nbsp;</strong>hire and acquire skills and competencies to beat that.<strong>&nbsp;</strong>But this is with a specific kind of a workforce with the changing workforce in the following two to three years or maybe five years, where do we see the industry moving towards?</p><p>&nbsp;</p><p><strong>Rahul:&nbsp;</strong>See, I think looking at the past few points, which we have spoken about looking at companies focusing on HR tools, are the products which can solve the problem of data and static records<strong>,&nbsp;</strong>a platform which is solving internal job boards, platforms that are solving the rescaling upskilling, plus a platform that solves the career path thing and the career progression as a problem statement.</p><p>Once organizations have this kind of platform on to that company, it will help them be ready for that, define the future, and be ahead of the competition. That is going to happen because of the workforce and the workforce which will they create. Now, let's take, for example, the Gen Z workforce, which you said is going to come on board. I think the AI-based platform will allow the organization and workforce to be ready in that environment because it will create an environment of ownership, pro-activeness collaboration, and mentorship. It will put them in the environment because the company will keep allocating them to new projects, either helping them learn the skill sets or acquiring behavioural skills and competencies. It will enable the kind of culture which will serve the need of the Gen Z workforce. And it will also help companies boom because they will have the next set of leaders who will start creating the value.</p><p>And I think it will change the culture that companies used to have because of specific policies. People were not moving across the projects due to skill-sets but due to policies. Now, the dynamic environment, quick movement across the projects, and all the dynamic dimensions that the company and the employees will be taking will help them be more collaborative and proactive. In the end, the value will be returning to them as part of that; they can focus on the new kind of skill sets to create something out of their personal goal.</p><p>&nbsp;</p><p><strong>Anannya:</strong>&nbsp;Right. So I think, you know, we've spoken about all the things, all the situations and scenarios, and the challenges that organizations and employees face today. Yes, the future for companies developing these AI tools is also great because they are also learning with constant internal and external changes across the pool. Right. But, you know, one last thing your take on, where do you see the AI organizations building these tools go from what they are today? What do they need to achieve in the next few years? Where do you see that? This is about organizations who are developing those AI tools; what are their challenges? And what is it that they need to move ahead?</p><p>&nbsp;</p><p><strong>Rahul:&nbsp;</strong>Sure. So I think lots of companies are focusing on these particular areas. Because they understand the importance of these problems and how important is it to mitigate these problems. So for organizations, that AI-based organization, or let me call it AI-based, talent decision platform, the obvious challenge is data. But I think the challenge will be how they can enable the future. I'm just going to talk very specifically about machine learning which is always about learning from the data. The teaching will come out from what they have based on their domain expertise, which is providing the data plus the kind of information they have internally plus what kind of information they will be getting from their customers or users. The quality of that information actually, that is the one challenge. The second challenge, even when you forget that learning because that learning is coming from the past. The challenge is how they will enable that futuristic vision because that learning is about past behaviour. It is all about how your AI systems react according to the environment - understanding the data, the signals, and the information is critical to enable the new capabilities. So today, right now, we are talking about internal job boards.</p><p>And we are talking about skill rescaling upskilling opportunities; we are talking about the career path, scarier progressions, we are talking about better normalization of the information, right. But there may be a problem that does not exist but may come up in the future. How is that going to be managed? So, AI-based companies must design their product platform by deep thinking, crunching the data, digging the data to enable the new capabilities and solve the problem more efficiently and effectively in the very dynamic nature of culture. And in your environment, that's what they need to focus on.&nbsp;</p><p>I think they have to focus more on building a great product, but that better, that great AI-based product, will come by focusing on building the right kind of data-based platform. And by acquiring the right type of talent, resources, people and technology, they also have to enable a more efficient way of utilizing the technology. So they can create much more value than that.</p><p>&nbsp;</p><p><strong>Anannya:&nbsp;</strong>Okay, great. Thank you, Rahul. You know, I think we had a very fruitful discussion today. And, you know, I believe our viewers will be able to understand and realize what is in store for them through this conversation. It was a pleasure speaking to you.</p><p>&nbsp;</p><p><strong>Rahul:</strong>&nbsp;Thank you.</p><p>&nbsp;</p><p>Watch the full video here&nbsp;</p><figure class=\"media\"><oembed url=\"https://www.youtube.com/watch?v=PVuVwdKTlv0\"></oembed></figure><p>&nbsp;</p>","slug":"what-s-next-with-the-future-of-work","subTitle":"Interesting conversation with Rahul Kulhari, our Head of Data Science, on the various challenges that organizations & employees are facing building up their capabilities for the next generation of work; their reactions to the pandemic, problems in engaging their employees effectively. We also talk about changing workplaces and the changing workforce, and future transformation. He is in conversation with Anannya Debnath, Content Head, EDGE.","sizeInGrid":null,"meta_description":null,"metaDesc":null,"published_at":"2021-09-17T07:14:40.899Z","created_at":"2021-09-16T13:42:04.206Z","updated_at":"2021-10-26T09:19:02.678Z","featuredImage":{"id":659,"name":"Rahul-video.jpg","alternativeText":"","caption":"","width":1880,"height":1253,"formats":{"thumbnail":{"name":"thumbnail_Rahul-video.jpg","hash":"thumbnail_Rahul_video_989f688b31","ext":".jpg","mime":"image/jpeg","width":234,"height":156,"size":8.11,"path":null,"url":"/uploads/thumbnail_Rahul_video_989f688b31.jpg"},"large":{"name":"large_Rahul-video.jpg","hash":"large_Rahul_video_989f688b31","ext":".jpg","mime":"image/jpeg","width":1000,"height":666,"size":90.74,"path":null,"url":"/uploads/large_Rahul_video_989f688b31.jpg"},"medium":{"name":"medium_Rahul-video.jpg","hash":"medium_Rahul_video_989f688b31","ext":".jpg","mime":"image/jpeg","width":750,"height":500,"size":55.59,"path":null,"url":"/uploads/medium_Rahul_video_989f688b31.jpg"},"small":{"name":"small_Rahul-video.jpg","hash":"small_Rahul_video_989f688b31","ext":".jpg","mime":"image/jpeg","width":500,"height":333,"size":28.4,"path":null,"url":"/uploads/small_Rahul_video_989f688b31.jpg"}},"hash":"Rahul_video_989f688b31","ext":".jpg","mime":"image/jpeg","size":259.61,"url":"/uploads/Rahul_video_989f688b31.jpg","previewUrl":null,"provider":"local","provider_metadata":null,"created_at":"2021-09-16T13:40:54.580Z","updated_at":"2021-09-17T07:12:36.800Z"},"categories":[]},"setting":{"id":1,"onScroll":false,"timeBound":true,"seconds":"15","userLeaving":false,"published_at":"2021-09-06T05:20:57.164Z","created_at":"2021-09-06T05:18:56.571Z","updated_at":"2021-10-25T05:51:58.729Z"}},"__N_SSG":true}